[M_Orchid_EndGame MissionDefinition]
MissionName="Treasure of the Sands"
MissionDescription="You may have defeated the Leviathan and found the lost Treasure of the Sands, but there's no reason to let a little thing like reality get in the way of you doing it all over again!"
TurnInDescription="You defeated Scarlett, slew the Leviathan, and found the Lost Treasure of the Sands! Talk about déjà vu!"
MissionSummary="Take Captain Blade's compass to Magnys Lighthouse."
TeaserText="The Lost Treasure is yours... again!"

[M_Orchid_EndGame:EscapeSpire MissionObjectiveDefinition]
ProgressMessage="Escape rock spire"

[M_Orchid_EndGame:EscapeSpireSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Escape Scarlett's ambush and reach the treasure!"
MissionDescriptionOverride="So, Scarlett betrayed you. Not a HUGE surprise, granted, but still pretty inconvenient. With her soldiers trying to snuff you at every turn, you really only have one option: kill 'em all, and try to reach the lost Treasure of the Sands before Scarlett can."

[M_Orchid_EndGame:KillHenchmen MissionObjectiveDefinition]
ProgressMessage="Kill Scarlett's henchmen"
